system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
a 0;
C 0.5; //half chord
t 0.1; //half thickness

cosC #calc "$C*cos(degToRad($a))";
sinC #calc "$C*sin(degToRad($a))";
cost #calc "$t*cos(degToRad($a))";
sint #calc "$t*sin(degToRad($a))";

mincosC #calc "-$C*cos(degToRad($a))";
minsinC #calc "-$C*sin(degToRad($a))";
mincost #calc "-$t*cos(degToRad($a))";
minsint #calc "-$t*sin(degToRad($a))";

plusY 3;
minY -3;

plusX 5;
minX -2;

vertices
(
    ($minX $minY 0) //0
    ($mincosC $minY 0) //1
    ($minsint $minY 0) //2
    ($cosC $minY 0) //3
    ($plusX $minY 0) //4
    ($plusX 0 0) //5
    ($cosC $minsinC 0) //6
    ($minsint $mincost 0) //7
    ($mincosC $sinC 0) //8
    ($minX 0 0) //9
    ($minX $plusY 0) //10
    ($mincosC $plusY 0) //11
    ($sint $plusY 0) //12
    ($cosC $plusY 0) //13
    ($plusX $plusY 0) //14
    ($sint $cost 0) //15

    ($minX $minY 0.02) //0
    ($mincosC $minY 0.02) //1
    ($minsint $minY 0.02) //2
    ($cosC $minY 0.02) //3
    ($plusX $minY 0.02) //4
    ($plusX 0 0.02) //5
    ($cosC $minsinC 0.02) //6
    ($minsint $mincost 0.02) //7
    ($mincosC $sinC 0.02) //8
    ($minX 0 0.02) //9
    ($minX $plusY 0.02) //10
    ($mincosC $plusY 0.02) //11
    ($sint $plusY 0.02) //12
    ($cosC $plusY 0.02) //13
    ($plusX $plusY 0.02) //14
    ($sint $cost 0.02) //15
);

c 10; //half chord mesh
y #calc "6.5 * $c";
x1 #calc "2 * $c";
x2 #calc "4.5 * $c";


blocks
(
    hex (0 1 8 9 16 17 24 25) ($x1 $y 1) simpleGrading (0.5 0.25 1) //1
    hex (1 2 7 8 17 18 23 24) ($c $y 1) simpleGrading (1 0.25 1) //2
    hex (2 3 6 7 18 19 22 23) ($c $y 1) simpleGrading (1 0.25 1) //3
    hex (3 4 5 6 19 20 21 22) ($x2 $y 1) simpleGrading (3 0.25 1) //4
    hex (6 5 14 13 22 21 30 29) ($x2 $y 1) simpleGrading (3 4 1) //5
    hex (15 6 13 12 31 22 29 28) ($c $y 1) simpleGrading (1 4 1) //6
    hex (8 15 12 11 24 31 28 27) ($c $y 1) simpleGrading (1 4 1) //7
    hex (9 8 11 10 25 24 27 26) ($x1 $y 1) simpleGrading (0.5 4 1) //8
);

boundary
(
    airfoil
    {
        type wall;
        faces
        (
            (8 15 31 24)
            (15 6 22 31)
            (8 7 23 24)
            (7 6 22 23)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 9 25 16)
            (9 10 26 25)
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
            (3 4 20 19)
            (10 11 27 26)
            (11 12 28 27)
            (13 14 30 29)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (14 5 21 30)
            (4 5 21 20)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 8 9)
            (1 2 7 8)
            (2 3 6 7)
            (3 4 5 6)
            (9 8 11 10)
            (8 15 12 11)
            (15 6 13 12)
            (6 5 14 13)

            (16 17 24 25)
            (17 18 23 24)
            (18 19 22 23)
            (19 20 21 22)
            (25 24 27 26)
            (24 31 28 27)
            (31 22 29 28)
            (22 21 30 29)
        );
    }
);


// ************************************************************************* //
